#ifndef SYSDBG_H
#define SYSDBG_H

#ifdef __cplusplus
extern "C"
{
#endif

    /**************************************************
     *函数名: sysdbg_init
     *功能  : 系统调试初始化
     *输入  : 无
     *输出  : 无
     *返回值: 无
     *注释  :
     ***************************************************/
    void sysdbg_init();

    /**************************************************
     *函数名: sysdbg_get_version
     *功能  : 获取系统调试库版本
     *输入  : 无
     *输出  : 无
     *返回值: 系统调试库版本信息
     *注释  :
     ***************************************************/
    char *sysdbg_get_version();

#ifdef __cplusplus
}
#endif

#endif